---
title: ConnectorSet
classe: Autodesk.Revit.DB.ConnectorSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# ConnectorSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `connectorSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `connectorSet.Size` | Int32 |
| `Void Clear()` | `connectorSet.Clear()` | Void |
| `Boolean Contains(Connector)` | `connectorSet.Contains(item)` | Boolean |
| `Int32 Erase(Connector)` | `connectorSet.Erase(item)` | Int32 |
| `ConnectorSetIterator ForwardIterator()` | `connectorSet.ForwardIterator()` | ConnectorSetIterator |
| `IEnumerator GetEnumerator()` | `connectorSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(Connector)` | `connectorSet.Insert(item)` | Boolean |
| `ConnectorSetIterator ReverseIterator()` | `connectorSet.ReverseIterator()` | ConnectorSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```